perf/root.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 60
      arrivalRate: 5
    

scenarios:
  - name: ping
    flow:
      - get:
          url: '/ping'

  - name: dictionary_base
    flow:
      - get:
          url: '/dictionary?word=test&cached=false'

  - name: dictionary_cached_base
    flow:
      - get:
          url: '/dictionary?word=test&cached=true'

  - name: spaceflight_news_base
    flow:
      - get:
          url: '/spaceflight_news'

  - name: quotes_base
    flow:
      - get:
          url: '/quote'