perf/root.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
      variables:
        word:
          - "monkey"
          - "word"
          - "football"
          - "artillery"
          - "dream"
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 60
      arrivalRate: 5
    

scenarios:
  - name: ping
    flow:
      - get:
          url: '/ping'

  - name: dictionary_base
    flow:
      - get:
          url: '/dictionary?word={{ word }}&cached=false'
    phases:
      - name: Ramp
        duration: 30
        arrivalRate: 1
        rampTo: 5
      - name: Plain
        duration: 60
        arrivalRate: 5

  - name: dictionary_cached
    flow:
      - get:
          url: '/dictionary?word={{ word }}&cached=true'
    phases:
      - name: Ramp
        duration: 30
        arrivalRate: 1
        rampTo: 5
      - name: Plain
        duration: 60
        arrivalRate: 5
      - name: Ramp
        duration: 60
        arrivalRate: 5
        rampTo: 20
      - name: Ramp
        duration: 60
        arrivalRate: 20
        rampTo: 50

  - name: dictionary_replicated
    flow:
      - get:
          url: '/dictionary?word={{ word }}&cached=false'
    phases:
      - name: Ramp
        duration: 30
        arrivalRate: 1
        rampTo: 5
      - name: Plain
        duration: 60
        arrivalRate: 5
      - name: Ramp
        duration: 60
        arrivalRate: 5
        rampTo: 20
      - name: Ramp
        duration: 60
        arrivalRate: 20
        rampTo: 50

  - name: dictionary_cached_1
    flow:
      - get:
          url: '/dictionary?word={{ word }}&cached=true'
    phases:
      - name: Ramp
        duration: 30
        arrivalRate: 1
        rampTo: 5
      - name: Ramp
        duration: 60
        arrivalRate: 5
        rampTo: 20
      - name: Ramp
        duration: 60
        arrivalRate: 20
        rampTo: 50
      
  - name: dictionary_replicated_1
    flow:
      - get:
          url: '/dictionary?word={{ word }}&cached=false'
    phases:
      - name: Ramp
        duration: 30
        arrivalRate: 1
        rampTo: 5
      - name: Ramp
        duration: 60
        arrivalRate: 5
        rampTo: 20
      - name: Ramp
        duration: 60
        arrivalRate: 20
        rampTo: 50

  - name: spaceflight_news_base
    flow:
      - get:
          url: '/spaceflight_news'
  

  - name: quotes_base
    flow:
      - get:
          url: '/quote'